In [ ]:
#### 과제1_1130 : df5에서 가격이 평균값이상인 경우만 출력하세요.

In [1]:
import pandas as pd
df1 = pd.read_csv('dataset/file_data.csv')
df1

    차림표    가격
0    냉면  5000
1   칼국수  6000
2  잔치국수  7000
3   수제비  8000
4    우동  9000

In [2]:
df2 = pd.DataFrame({
    '차림표':['비빔밥','돈까스','라면','김밥','제육덮밥'],
    '가격':[7000,8000,3000,3000,9000]})
df2

    차림표    가격
0   비빔밥  7000
1   돈까스  8000
2    라면  3000
3    김밥  3000
4  제육덮밥  9000

In [ ]:
# Q. 컬럼 이름 바꿔서 조인해보세요

In [3]:
# 솔루션
columns = {'차림표' : '메뉴2', '가격':'가격2'}
df4 = df2.rename(columns = columns)
df4

    메뉴2   가격2
0   비빔밥  7000
1   돈까스  8000
2    라면  3000
3    김밥  3000
4  제육덮밥  9000

In [4]:
df5 = df1.join(df4)
df5

    차림표    가격   메뉴2   가격2
0    냉면  5000   비빔밥  7000
1   칼국수  6000   돈까스  8000
2  잔치국수  7000    라면  3000
3   수제비  8000    김밥  3000
4    우동  9000  제육덮밥  9000

In [ ]:
#### 과제1_1130 : df5에서 가격이 평균값이상인 경우만 출력하세요.

In [7]:
# 솔루션
df5[df5.가격 >= df5.가격.mean()]

    차림표    가격   메뉴2   가격2
2  잔치국수  7000    라면  3000
3   수제비  8000    김밥  3000
4    우동  9000  제육덮밥  9000

In [ ]:
#### 과제2_1130 : df5에서 가격이 6000원 이상인 경우의 행 인덱스를 출력하세요.

In [16]:
idx = df5[df5.가격 >= 6000].index
idx

Index([1, 2, 3, 4], dtype='int64')